---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
source: html/275fe6a0-7d6b-d1f5-e143-c25950c6af21.htm
---
# StructuralSectionCProfileWithLips Members

Creates a new instance of Structural Section C Profile With Lips shape with the associated set of parameters,
 used to attach to structural element.